Masmiseim36/nxpSDK/boards/frdmk22f_sa9500/project_template/pin_mux.h
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD4 (number 61), SH_J2[8]/SH_U1[12]/SH_S_SSB_GPIO3/SPI0_PCS1/SPI1_PCS0/J2[6]/J6[4]/LLWU_P14
  @{ */
#define BOARD_S_SSB_GPIO3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_S_SSB_GPIO3_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                     /* @} */

/*! @name PORTD7 (number 64), SH_J2[9]SH_U1[11]/S_SPI_SDO/J2[10]
  @{ */
#define BOARD_SPI_S_MISO_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SPI_S_MISO_PIN 7U     /*!<@brief PORTD pin index: 7 */
                                    /* @} */

/*! @name PORTD5 (number 62), SH_U1[8]/SH_J1[8]/SH_S_SPI_SCLK/J2[12]/BLUE_LED
  @{ */
#define BOARD_S_SPI_SCLK_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_S_SPI_SCLK_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                    /* @} */

/*! @name PORTD6 (number 63), SH_J1[9]/SH_U1[10]/SH_S_SPI_MOSI/J2[8]
  @{ */
#define BOARD_S_SPI_MOSI_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_S_SPI_MOSI_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitSPIPins(void);

/*! @name PORTB2 (number 37), SH_J1[8]/SH_J9[3]/SH_U1[8]/SH_S_I2C_SCL_SCLK/J24[12]/U8[4]/U18[28]/I2C0_SCL
  @{ */
#define SHIELD_S1_I2C_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SHIELD_S1_I2C_SCL_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                     /* @} */

/*! @name PORTB3 (number 38), SH_J1[9]/SH_J8[3]/SH_U1[10]/SHS_I2C_SDA_MOSI/J24[10]/U8[6]/U18[27]/I2C0_SDA
  @{ */
#define SHIELD_S1_I2C_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SHIELD_S1_I2C_SDA_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                     /* @} */

/*! @name PORTB0 (number 35), SH_J2[6]/SH_U1[15]/SH_INT_O/J24[2]/LLWU_P5
  @{ */
#define SHIELD_INT_O_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define SHIELD_INT_O_PORT PORTB /*!<@brief PORT device name: PORTB */
#define SHIELD_INT_O_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitI2C1Pins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTA1 (number 23), J2[4]/RED_LED
  @{ */
#define BOARD_LEDRGB_RED_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_LEDRGB_RED_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_LEDRGB_RED_PIN 1U     /*!<@brief PORTA pin index: 1 */
                                    /* @} */

/*! @name PORTA2 (number 24), J1[8]/GREEN_LED
  @{ */
#define BOARD_LEDRGB_GREEN_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_LEDRGB_GREEN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_LEDRGB_GREEN_PIN 2U     /*!<@brief PORTA pin index: 2 */
                                      /* @} */

/*! @name PORTD5 (number 62), SH_U1[8]/SH_J1[8]/SH_S_SPI_SCLK/J2[12]/BLUE_LED
  @{ */
#define BOARD_LEDRGB_BLUE_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LEDRGB_BLUE_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LEDRGB_BLUE_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*! @name PORTB17 (number 40), PUSH_BUTTON1
  @{ */
#define BOARD_SW3_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_SW3_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SW3_PIN 17U    /*!<@brief PORTB pin index: 17 */
                             /* @} */

/*! @name PORTC1 (number 44), SH_J1[5]/SH_U1[6]/SH_J3[1]/SH_BKGD/J24[6]/LLWU_P6/PUSH_BUTTON2
  @{ */
#define BOARD_SW2_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_SW2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SW2_PIN 1U     /*!<@brief PORTC pin index: 1 */
                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void);

#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTE1 (number 2), SH_J1[8]/SH_J9[1]/SH_U1[8]/SH_S_I2C_SCL0/J2[20]/UART1_TX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_DEBUG_UART_RX_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                       /* @} */

/*! @name PORTE0 (number 1), SH_J1[9]/SH_J8[1]/SH_U1[10]/SH_S_I2C_SDA0/J2[18]/UART1_RX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_DEBUG_UART_TX_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORTC4 (number 49), J8[P2]/J24[9]/uSD_card_CS
  @{ */
#define BOARD_SD_CARD_DAT3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SD_CARD_DAT3_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                      /* @} */

/*! @name PORTD1 (number 58), U8[9]/J8[P5]/SPI0_SCK/uSD_SPI_CL/ACCEL_INT2
  @{ */
#define BOARD_SD_CARD_CLK_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SD_CARD_CLK_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                     /* @} */

/*! @name PORTD2 (number 59), J1[2]/J8[P3]/uSD_SPI_MOSI
  @{ */
#define BOARD_SD_CARD_CMD_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SD_CARD_CMD_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                     /* @} */

/*! @name PORTD3 (number 60), J1[4]/J8[P7]/SPI0_SIN/uSD_SPI_MISO
  @{ */
#define BOARD_SD_CARD_DAT0_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SD_CARD_DAT0_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                      /* @} */

/*! @name PORTB16 (number 39), SH_J2[7]/SH_U1[13]/SH_INT_I/J1[6]/J8[G1]/SD_CARD_DETECT
  @{ */
#define BOARD_SD_CARD_DETECT_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_SD_CARD_DETECT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SD_CARD_DETECT_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void);

/*! @name PORTB2 (number 37), SH_J1[8]/SH_J9[3]/SH_U1[8]/SH_S_I2C_SCL_SCLK/J24[12]/U8[4]/U18[28]/I2C0_SCL
  @{ */
#define BOARD_S1_I2C_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_S1_I2C_SCL_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                    /* @} */

/*! @name PORTB3 (number 38), SH_J1[9]/SH_J8[3]/SH_U1[10]/SHS_I2C_SDA_MOSI/J24[10]/U8[6]/U18[27]/I2C0_SDA
  @{ */
#define BOARD_S1_I2C_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_S1_I2C_SDA_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                    /* @} */

/*! @name PORTD0 (number 57), U8[11]/LLWU_P12/ACCEL_INT1
  @{ */
#define BOARD_ACCEL_INT1_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_ACCEL_INT1_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_ACCEL_INT1_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                    /* @} */

/*! @name PORTD1 (number 58), U8[9]/J8[P5]/SPI0_SCK/uSD_SPI_CL/ACCEL_INT2
  @{ */
#define BOARD_ACCEL_INT2_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_ACCEL_INT2_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_ACCEL_INT2_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitAccelPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
